Revit 2027 API
LayerCategoryType Enumeration
 An enumerated type listing category types supported in an ExportLayerTable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LayerCategoryType
Public Enumeration LayerCategoryType
public enum class LayerCategoryType
type LayerCategoryType
Members
Member name | Value | Description
AnalyticalModel | 2 |  AnalyticalModel categories.
Annotation | 1 |  Annotation categories.
Imported | 3 |  Imported categories.
Model | 0 |  Model categories.
Modifier | 4 |  A special value related to modifiers.
Unsorted | -1 |  A default unsorted type.
See Also
Reference
Autodesk.Revit.DB Namespace